FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
/*-------------------------------------------------------------------------*
 * File:  LPC43xx_SD_MMC.c
 *-------------------------------------------------------------------------*
 * Description:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include <string.h>
#include <uEZ.h>
#include <uEZProcessor.h>
#include <uEZPlatformAPI.h>
#include <HAL/Interrupt.h>
#include "LPC43xx_SD_MMC.h"
#include "LPC43xx_GPIO.h"
#include "LPC43xx_UtilityFuncs.h"
#include <Source/Library/SEGGER/SystemView/SEGGER_SYSVIEW.h>
#include <Source/Library/SEGGER/RTT/SEGGER_RTT.h>

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
#ifndef NUM_MAX_BLOCKS                   // Currently 32 seems to be minimum size
    #define NUM_MAX_BLOCKS               128         /* Block transfer FIFO depth (>= 2), 20+ recommended */
#endif

#define DEBUG_PRINTF_FUNCTION(...) 
//#define DEBUG_PRINTF_FUNCTION(...) DEBUG_RTT_WriteString(0, __VA_ARGS__)
//#define DEBUG_PRINTF_FUNCTION(...) DEBUG_SV_PrintfE(__VA_ARGS__)

#if(DEBUG_SD_CRC_COUNT==1)
TUInt32 G_SD_CRC_error;
#endif

/** @brief SDIO FIFO threshold defines
 */
#define MCI_FIFOTH_TX_WM(x)     ((x) & 0xFFF)
#define MCI_FIFOTH_RX_WM(x)     (((x) & 0xFFF) << 16)
#define MCI_FIFOTH_DMA_MTS_1    (0UL << 28)
#define MCI_FIFOTH_DMA_MTS_4    (1UL << 28)
#define MCI_FIFOTH_DMA_MTS_8    (2UL << 28)
#define MCI_FIFOTH_DMA_MTS_16   (3UL << 28)
#define MCI_FIFOTH_DMA_MTS_32   (4UL << 28)
#define MCI_FIFOTH_DMA_MTS_64   (5UL << 28)
#define MCI_FIFOTH_DMA_MTS_128  (6UL << 28)
#define MCI_FIFOTH_DMA_MTS_256  (7UL << 28)

/** @brief Bus mode register defines
 */
#define MCI_BMOD_PBL1           (0 << 8)        /*!< Burst length = 1 */
#define MCI_BMOD_PBL4           (1 << 8)        /*!< Burst length = 4 */
#define MCI_BMOD_PBL8           (2 << 8)        /*!< Burst length = 8 */
#define MCI_BMOD_PBL16          (3 << 8)        /*!< Burst length = 16 */
#define MCI_BMOD_PBL32          (4 << 8)        /*!< Burst length = 32 */
#define MCI_BMOD_PBL64          (5 << 8)        /*!< Burst length = 64 */
#define MCI_BMOD_PBL128         (6 << 8)        /*!< Burst length = 128 */
#define MCI_BMOD_PBL256         (7 << 8)        /*!< Burst length = 256 */
#define MCI_BMOD_DE             (1 << 7)        /*!< Enable internal DMAC */
#define MCI_BMOD_DSL(len)       ((len) << 2)    /*!< Descriptor skip length */
#define MCI_BMOD_FB             (1 << 1)        /*!< Fixed bursts */
#define MCI_BMOD_SWR            (1 << 0)        /*!< Software reset of internal registers */

/** @brief  SDIO control register defines
 */
#define MCI_CTRL_USE_INT_DMAC   (1 << 25)       /*!< Use internal DMA */
#define MCI_CTRL_CARDV_MASK     (0x7 << 16)     /*!< SD_VOLT[2:0} pins output state mask */
#define MCI_CTRL_CEATA_INT_EN   (1 << 11)       /*!< Enable CE-ATA interrupts */
#define MCI_CTRL_SEND_AS_CCSD   (1 << 10)       /*!< Send auto-stop */
#define MCI_CTRL_SEND_CCSD      (1 << 9)        /*!< Send CCSD */
#define MCI_CTRL_ABRT_READ_DATA (1 << 8)        /*!< Abort read data */
#define MCI_CTRL_SEND_IRQ_RESP  (1 << 7)        /*!< Send auto-IRQ response */
#define MCI_CTRL_READ_WAIT      (1 << 6)        /*!< Assert read-wait for SDIO */
#define MCI_CTRL_INT_ENABLE     (1 << 4)        /*!< Global interrupt enable */
#define MCI_CTRL_DMA_RESET      (1 << 2)        /*!< Reset internal DMA */
#define MCI_CTRL_FIFO_RESET     (1 << 1)        /*!< Reset data FIFO pointers */
#define MCI_CTRL_RESET          (1 << 0)        /*!< Reset controller */

/** @brief SDIO Power Enable register defines
 */
#define MCI_POWER_ENABLE        0x1             /*!< Enable slot power signal (SD_POW) */

/** @brief SDIO Clock source register defines
 */
#define MCI_CLKSRC_CLKDIV0      0
#define MCI_CLKSRC_CLKDIV1      1
#define MCI_CLKSRC_CLKDIV2      2
#define MCI_CLKSRC_CLKDIV3      3
#define MCI_CLK_SOURCE(clksrc)  (clksrc)        /*!< Set cklock divider source */

/** @brief Commonly used definitions
 */
#define SD_FIFO_SZ              32              /*!< Size of SDIO FIFOs (32-bit wide) */

/** @brief SDIO Command register defines
 */
#define MCI_CMD_START           (1UL << 31)     /*!< Start command */
#define MCI_CMD_VOLT_SWITCH     (1 << 28)       /*!< Voltage switch bit */
#define MCI_CMD_BOOT_MODE       (1 << 27)       /*!< Boot mode */
#define MCI_CMD_DISABLE_BOOT    (1 << 26)       /*!< Disable boot */
#define MCI_CMD_EXPECT_BOOT_ACK (1 << 25)       /*!< Expect boot ack */
#define MCI_CMD_ENABLE_BOOT     (1 << 24)       /*!< Enable boot */
#define MCI_CMD_CCS_EXP         (1 << 23)       /*!< CCS expected */
#define MCI_CMD_CEATA_RD        (1 << 22)       /*!< CE-ATA read in progress */
#define MCI_CMD_UPD_CLK         (1 << 21)       /*!< Update clock register only */
#define MCI_CMD_INIT            (1 << 15)       /*!< Send init sequence */
#define MCI_CMD_STOP            (1 << 14)       /*!< Stop/abort command */
#define MCI_CMD_PRV_DAT_WAIT    (1 << 13)       /*!< Wait before send */
#define MCI_CMD_SEND_STOP       (1 << 12)       /*!< Send auto-stop */
#define MCI_CMD_STRM_MODE       (1 << 11)       /*!< Stream transfer mode */
#define MCI_CMD_DAT_WR          (1 << 10)       /*!< Read(0)/Write(1) selection */
#define MCI_CMD_DAT_EXP         (1 << 9)        /*!< Data expected */
#define MCI_CMD_RESP_CRC        (1 << 8)        /*!< Check response CRC */
#define MCI_CMD_RESP_LONG       (1 << 7)        /*!< Response length */
#define MCI_CMD_RESP_EXP        (1 << 6)        /*!< Response expected */
#define MCI_CMD_INDX(n)         ((n) & 0x1F)

/** @brief SDIO Clock Enable register defines
 */
#define MCI_CLKEN_LOW_PWR       (1 << 16)       /*!< Enable clock idle for slot */ // Only for SD or MMC, NOT for SDIO
#define MCI_CLKEN_ENABLE        (1 << 0)        /*!< Enable slot clock */


/** @brief  SDIO chained DMA descriptor
 */
typedef struct {
    volatile uint32_t des0;                     /*!< Control and status */
    volatile uint32_t des1;                     /*!< Buffer size(s) */
    volatile uint32_t des2;                     /*!< Buffer address pointer 1 */
    volatile uint32_t des3;                     /*!< Buffer address pointer 2 */
} LPC43xx_SD_MMC_DMADescriptor;

