FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
/** @brief  SDIO DMA descriptor control (des0) register defines
 */
#define MCI_DMADES0_OWN         (1UL << 31)     /*!< DMA owns descriptor bit */
#define MCI_DMADES0_CES         (1 << 30)       /*!< Card Error Summary bit */
#define MCI_DMADES0_ER          (1 << 5)        /*!< End of descriptopr ring bit */
#define MCI_DMADES0_CH          (1 << 4)        /*!< Second address chained bit */
#define MCI_DMADES0_FS          (1 << 3)        /*!< First descriptor bit */
#define MCI_DMADES0_LD          (1 << 2)        /*!< Last descriptor bit */
#define MCI_DMADES0_DIC         (1 << 1)        /*!< Disable interrupt on completion bit */

/** @brief  SDIO DMA descriptor size (des1) register defines
 */
#define MCI_DMADES1_BS1(x)      (x)             /*!< Size of buffer 1 */
#define MCI_DMADES1_BS2(x)      ((x) << 13)     /*!< Size of buffer 2 */
#define MCI_DMADES1_MAXTR       4096            /*!< Max transfer size per buffer */

/** @brief SDIO Clock divider register defines
 */
#define MCI_CLOCK_DIVIDER(dn, d2) ((d2) << ((dn) * 8))  /*!< Set cklock divider */

/** @brief  SDIO device type
 */
#define TRANSFER_STATUS_READING             0x01
#define TRANSFER_STATUS_WRITING             0x02
#define TRANSFER_STATUS_BUFFER_OVERRUN      0x04
#define TRANSFER_STATUS_SD_MMC_ERROR           0x08
#define TRANSFER_STATUS_DONE                0x10
#define TRANSFER_STATUS_ANY_ERROR   \
    (TRANSFER_STATUS_BUFFER_OVERRUN|TRANSFER_STATUS_SD_MMC_ERROR)
      
#define MCI_RINTSTS_ERROR_BITS_TO_IGNORE  (MCI_INT_CMD_DONE | MCI_INT_ACD | MCI_INT_CD | MCI_INT_SDIO)

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    /* MCI_IRQ_CB_FUNC_T irq_cb; */
        LPC43xx_SD_MMC_DMADescriptor mci_dma_dd[1 + (0x10000 / MCI_DMADES1_MAXTR)];
    /* uint32_t sdio_clk_rate; */
    /* uint32_t sdif_slot_clk_rate; */
    /* int32_t clock_enabled; */
} LPC43xx_SD_MMC_DMAArea;

/*-------------------------------------------------------------------------*
 * Workspace:
 *-------------------------------------------------------------------------*/
typedef struct {
    const HAL_SD_MMC *iHAL;

    T_uezGPIOPortPin iCardDetect;
    T_uezGPIOPortPin iWriteProtect;

    LPC43xx_SD_MMC_DMAArea iDMAArea;

    T_SD_MMCReceptionComplete iReceptionCompleteCallback;
    void *iReceptionCompleteCallbackWorkspace;

    T_SD_MMCTransmissionComplete iTransmissionCompleteCallback;
    void *iTransmissionCompleteCallbackWorkspace;
    
    T_SD_MMCError iErrorCallback;
    void *iErrorCallbackWorkspace;

    TUInt32 iRCA;       // Relative Card Address

    TUInt32 iSpeed;     // Speed of clock rate in Hz

    volatile TUInt8 sdio_wait_exit;
    
    T_LPC43xx_SD_MMC_Pins iSdMmcPins;
} T_LPC43xx_SD_MMC_Workspace;

T_LPC43xx_SD_MMC_Workspace *G_SD_MMCWorkspace;
static TUInt32 G_SourceClkFrequency;

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
void LPC43xx_SD_MMC_ProcessInterrupt(T_LPC43xx_SD_MMC_Workspace *p);

/*---------------------------------------------------------------------------*
 * Interrupt:  LPC43xx_SD_MMC_Interrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      A SD_MMC Interrupt has come in.  Process the one workspace attached
 *      to this interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC43xx_SD_MMC_Interrupt)
{
    IRQ_START();
    LPC43xx_SD_MMC_ProcessInterrupt(G_SD_MMCWorkspace);
    IRQ_END();
}

/* Function to clear interrupt & FIFOs */
static void ISetClearIntFifo(void)
{
    /* reset all blocks */
    LPC_SDMMC->CTRL |= MCI_CTRL_FIFO_RESET;

    /* wait till resets clear */
    while (LPC_SDMMC->CTRL & MCI_CTRL_FIFO_RESET) {}

    /* Clear interrupt status */
    LPC_SDMMC->RINTSTS = 0xFFFFFFFF;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Process an interrupt for this workspace
 * Inputs:
 *      void *aWorkspace          -- SD_MMC Workspace
 * Outputs:
 *      void
 *---------------------------------------------------------------------------*/
void LPC43xx_SD_MMC_ProcessInterrupt(T_LPC43xx_SD_MMC_Workspace *p)
{
#ifdef CORE_M4
    InterruptDisable(SDIO_IRQn);
#endif
#ifdef CORE_M0
    InterruptDisable(M0_SDIO_IRQn);
#endif
#ifdef CORE_M0SUB
    // None
#endif

    LPC_SDMMC->RINTSTS = MCI_INT_TXDR; // Don't use currently, clear it
    LPC_SDMMC->RINTSTS = MCI_INT_RXDR; // Don't use currently, clear it
    uint32_t temp = LPC_SDMMC->RINTSTS;
        
    // Did we finish a DMA?
    if (LPC_SDMMC->RINTSTS & MCI_INT_DATA_OVER) {
        // Clear the data transfer complete flag
        LPC_SDMMC->RINTSTS = MCI_INT_DATA_OVER;
        // We doing a reception callback?  You only get one
        if (p->iReceptionCompleteCallback) {
            p->iReceptionCompleteCallback(p->iReceptionCompleteCallbackWorkspace);
            p->iReceptionCompleteCallback = 0;
        }

        // We doing a transmission callback?  You only get one.
        if (p->iTransmissionCompleteCallback) {
            p->iTransmissionCompleteCallback(p->iTransmissionCompleteCallbackWorkspace);
            p->iTransmissionCompleteCallback = 0;
        }
    }
    if (LPC_SDMMC->RINTSTS & MCI_INT_CMD_DONE) {
        //LPC_SDMMC->RINTSTS = MCI_INT_CMD_DONE; // Don't clear the flag so we can check it later
        if (p->sdio_wait_exit != 0) { // only 0 when init workspace, 1 when int cleared or set to 2 here
            // Set this interrupt for SDIO commands
            p->sdio_wait_exit = 2;
        }
    }
    
    temp &=  ~(MCI_RINTSTS_ERROR_BITS_TO_IGNORE);
      
    if(temp > 0x0) {
      // errors
      if (LPC_SDMMC->RINTSTS & MCI_INT_RESP_ERR) { // Command response error
          DEBUG_PRINTF_FUNCTION("RSE");
      }
      
      // 6-8 indicate that the received data may have errors. If there was a response time-out, then no data transfer occurred.
      if (LPC_SDMMC->RINTSTS & MCI_INT_RCRC) { // Response CRC error
          DEBUG_PRINTF_FUNCTION("RCR");
      }
      
