FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
  /* From ES_LPC435x/3x/2x/1x Rev 6.8:    Problem:
  * The CMD6 returned status block always gets a data CRC error although the status data is
  * correct. The data CRC error prevents the switching of the SD memory card from the
  * default mode to high-speed mode.

  * Work-around:
  * Capture the 64 bits of CRC data that follow the 512 bits of data allowing the CRC data to
  * be calculated in software. The DMA buffer length and SD/MMC BYTCNT must be set to
  * 72 (versus 64). The CRC data consists of four interleaved 16-bit words, one for each of
  * the four serialized SD data bits. If all four of the calculated CRCs match the captured
  * CRCs, the software can clear the data CRC error flag bit.*/

      if (LPC_SDMMC->RINTSTS & MCI_INT_DCRC) { // Data CRC error - CRC error occurred during data reception.
          LPC_SDMMC->RINTSTS = MCI_INT_DCRC; // clear error
          DEBUG_PRINTF_FUNCTION("DCR"); // We get this with wrong pin settings or too high frequency and it is a real CRC error and we fail file comparison read back.
          #if(DEBUG_SD_CRC_COUNT==1)
          G_SD_CRC_error++;
          #endif
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_RTO) { // Response timeout error (RTO_BAR)
          DEBUG_PRINTF_FUNCTION("RTO");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_DTO) { // Data read timeout (DRTO_BDS) - Card has not sent data within the time-out period.
          DEBUG_PRINTF_FUNCTION("DTO");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_HTO) { // Host data starvation error
          DEBUG_PRINTF_FUNCTION("HDS");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_FRUN) { //  FIFO overrun/underrun error
          DEBUG_PRINTF_FUNCTION("FOV");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_HLE) { //  Hardware locked write error
          DEBUG_PRINTF_FUNCTION("HLE");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_SBE) { // Start bit error - Start bit was not received during data reception.
          DEBUG_PRINTF_FUNCTION("SBE");
      }
      
      if (LPC_SDMMC->RINTSTS & MCI_INT_EBE) { // End-bit error - End bit was not received during data reception or for a write operation; a CRC error is indicated by the card.
          DEBUG_PRINTF_FUNCTION("EBE");
      }
      
      if (LPC_SDMMC->IDSTS & (1 << 10)) { // 
          DEBUG_PRINTF_FUNCTION("HOT");
      }
      if (LPC_SDMMC->IDSTS & (1 << 11)) { // 
          DEBUG_PRINTF_FUNCTION("HOR");
      }
      // Note that non-errors aren't listed here, such as RTO/DTO/ACD, etc.
      
      if (temp & MCI_INT_DATA_OVER) { 
          // This possibly indicates command finished as the bit is never set on a real timeout
      } else {      
        if (p->iErrorCallback) {
            p->iErrorCallback(p->iErrorCallbackWorkspace);
            // can't clear FIFO here using normal clear command, not sure yet if that helps
            //p->iErrorCallback = 0;
        }
      }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_InitializeWorkspace(void *aWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    p->iHAL = &LPC43xx_SD_MMC_Interface;

    p->iCardDetect = GPIO_NONE;
    p->iWriteProtect = GPIO_NONE;
    p->iReceptionCompleteCallback = 0;
    p->iReceptionCompleteCallbackWorkspace = 0;
    p->iTransmissionCompleteCallback = 0;
    p->iTransmissionCompleteCallbackWorkspace = 0;
    p->iErrorCallback = 0;
    p->iErrorCallbackWorkspace = 0;
    p->iRCA = 0;
    p->sdio_wait_exit = 0;
    //p->iSpeed = UEZPlatform_MCI_DefaultFreq();

    G_SD_MMCWorkspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the SD_MMC Controller
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_Reset(void *aWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    
    p->iCardDetect = GPIO_NONE;
    p->iWriteProtect = GPIO_NONE;
    p->iReceptionCompleteCallback = 0;
    p->iTransmissionCompleteCallback = 0;
    p->iRCA = 0;
    p->sdio_wait_exit = 0;

    /* Software reset */
    LPC_SDMMC->BMOD = MCI_BMOD_SWR;

    /* reset all blocks */
    LPC_SDMMC->CTRL = MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET | MCI_CTRL_DMA_RESET;
    while (LPC_SDMMC->CTRL & (MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET | MCI_CTRL_DMA_RESET))
        {}

    LPC_SDMMC->CTYPE = 0; // 1-bit mode to start
    LPC_SDMMC->DBADDR = 0; // 
    LPC_SDMMC->CLKDIV = 0; // 
    LPC_SDMMC->BYTCNT = 0x200; //
    LPC_SDMMC->CMDARG = 0; //
    LPC_SDMMC->CMD = 0; //

    /* Internal DMA setup for control register */
    LPC_SDMMC->CTRL = MCI_CTRL_USE_INT_DMAC | MCI_CTRL_INT_ENABLE;
    LPC_SDMMC->INTMASK = 0;

    /* Clear the interrupts for the host controller */
    LPC_SDMMC->RINTSTS = 0xFFFFFFFF;

    /* Put in max timeout */
    LPC_SDMMC->TMOUT = 0xFFFFFFFF;

    /* FIFO threshold settings for DMA, DMA burst of 4,   FIFO watermark at 16 */
    LPC_SDMMC->FIFOTH = MCI_FIFOTH_DMA_MTS_4 | MCI_FIFOTH_RX_WM((SD_FIFO_SZ / 2) - 1) | MCI_FIFOTH_TX_WM(SD_FIFO_SZ / 2);

    /* Enable internal DMA, burst size of 4, fixed burst */
    LPC_SDMMC->BMOD = MCI_BMOD_DE | MCI_BMOD_PBL4 | MCI_BMOD_DSL(4);

    /* disable clock to CIU (needs latch) */
    LPC_SDMMC->CLKENA = 0;
    LPC_SDMMC->CLKSRC = 0;

