FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
    #if(DEBUG_SD_CRC_COUNT==1)
    G_SD_CRC_error = 0;
    #endif

    // Enable interrupts
#ifdef CORE_M4
    InterruptEnable(SDIO_IRQn);
#endif
#ifdef CORE_M0
    InterruptEnable(M0_SDIO_IRQn);
#endif
#ifdef CORE_M0SUB
    //None
#endif
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_PowerOn
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the SD_MMC power on the target
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_PowerOn(void *aWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;

#if 0 // not implemented features so don't include the unused consts.
    static const T_LPC43xx_SCU_ConfigList sd_pow[] = {
            {GPIO_P1_8     , SCU_NORMAL_DRIVE_DEFAULT(7)}, //SD_POW   SD/MMC power monitor output.
            {GPIO_P6_8     , SCU_NORMAL_DRIVE_DEFAULT(7)}, //SD_POW   SD/MMC power monitor output.
            {GPIO_P6_15    , SCU_NORMAL_DRIVE_DEFAULT(5)}, //SD_POW   SD/MMC power monitor output.
    };

    static const T_LPC43xx_SCU_ConfigList sd_cd[] = {
            {GPIO_P1_6     , SCU_NORMAL_DRIVE_DEFAULT(7)}, //SD_CD    SD/MMC card detect input.
            {GPIO_P6_7     , SCU_NORMAL_DRIVE_DEFAULT(7)}, //SD_CD    SD/MMC card detect input.
    };

    static const T_LPC43xx_SCU_ConfigList sd_wp[] = {
            {GPIO_P6_29    , SCU_NORMAL_DRIVE_DEFAULT(5)}, //SD_WP    SD/MMC card write protect input.
            {GPIO_P7_24    , SCU_NORMAL_DRIVE_DEFAULT(5)}, //SD_WP    SD/MMC card write protect input.
    };
#endif

    // Recommend settings for EHS=0 for CMD/DAT and EHS=1 for clock from LPC435x/3x/2x/1x 11.20 SD/MMC.
    static const T_LPC43xx_SCU_ConfigList sd_clk[] = {
            {GPIO_PZ_Z_PC_0, SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_FAST, SCU_EZI_DISABLE,SCU_ZIF_DISABLE)}, //SD_CLK   SD/MMC card clock.
    };

    static const T_LPC43xx_SCU_ConfigList sd_cmd[] = {
            {GPIO_P1_9     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_CMD   SD/MMC command signal.
            {GPIO_P6_9     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_CMD   SD/MMC command signal.
    };

    static const T_LPC43xx_SCU_ConfigList sd_dat0[] = {
            {GPIO_P1_2     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT0  SD/MMC data bus line 0.
            {GPIO_P6_3     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT0  SD/MMC data bus line 0.
    };

    static const T_LPC43xx_SCU_ConfigList sd_dat1[] = {
            {GPIO_P1_3     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT1  SD/MMC data bus line 1.
            {GPIO_P6_4     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT1  SD/MMC data bus line 1.
    };

    static const T_LPC43xx_SCU_ConfigList sd_dat2[] = {
            {GPIO_P1_4     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT2  SD/MMC data bus line 2.
            {GPIO_P6_5     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT2  SD/MMC data bus line 2.
    };

    static const T_LPC43xx_SCU_ConfigList sd_dat3[] = {
            {GPIO_P1_5     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT3  SD/MMC data bus line 3.
            {GPIO_P6_6     , SCU_NORMAL_DRIVE(7, SCU_EPD_DISABLE, SCU_EPUN_DISABLE,SCU_EHS_SLOW, SCU_EZI_ENABLE, SCU_ZIF_DISABLE)}, //SD_DAT3  SD/MMC data bus line 3.
    };
    
    // Disable interrupts
#ifdef CORE_M4
    InterruptDisable(SDIO_IRQn);
#endif
#ifdef CORE_M0
    InterruptDisable(M0_SDIO_IRQn);
#endif
#ifdef CORE_M0SUB
    //None
#endif

    UEZGPIOUnlock(p->iSdMmcPins.iCMD);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT0);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT1);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT2);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT3);
    UEZGPIOUnlock(p->iSdMmcPins.iCLK);
    UEZGPIOUnlock(p->iSdMmcPins.iPOW);
    //UEZGPIOUnlock(p->iSdMmcPins.iCardDetect);
    //UEZGPIOUnlock(p->iSdMmcPins.iWriteProtect);

    // Power is enabled before we switch the pins to peripheral mode.
    // Manually turn SDcard power on (if not already on)
    UEZGPIOSet(p->iSdMmcPins.iPOW);
    //LPC_SDMMC->PWREN = 0x01; // not using function pin, using GPIO set below.

    // SD spec says that ramp to 0.5V is up to 250ms, then 35ms ramp to 3.3V.
    UEZTaskDelay(50); // MMC spec said to wait 35ms after power on before CMD
    // We ramp on these uEZGUIs almost instantly, less than 20uS on this switch.

    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iCMD, sd_cmd, ARRAY_COUNT(sd_cmd));
    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iDAT0, sd_dat0, ARRAY_COUNT(sd_dat0));
    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iDAT1, sd_dat1, ARRAY_COUNT(sd_dat1));
    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iDAT2, sd_dat2, ARRAY_COUNT(sd_dat2));
    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iDAT3, sd_dat3, ARRAY_COUNT(sd_dat3));
    LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iCLK, sd_clk, ARRAY_COUNT(sd_clk));
    //LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iPOW, sd_pow, ARRAY_COUNT(sd_pow));
    //LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iCardDetect, sd_cd, ARRAY_COUNT(sd_cd));
    //LPC43xx_SCU_ConfigPinOrNone(p->iSdMmcPins.iWriteProtect, sd_wp, ARRAY_COUNT(sd_wp));

    LPC43xx_SD_MMC_Reset((void *)p);
    
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_PowerOff
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the SD_MMC power off the target
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_PowerOff(void *aWorkspace)
{
    LPC_SDMMC->INTMASK = 0;
    LPC_SDMMC->CTRL   &= ~(MCI_CTRL_INT_ENABLE); // disables interrupts
    //LPC_SDMMC->CTRL = 1; // would reset DMA if uncommented
    LPC_SDMMC->RINTSTS = 0xFFFFFFFF;

    LPC_SDMMC->PWREN = 0x00;
    LPC_SDMMC->CLKENA = 0;

    // Disable interrupts
#ifdef CORE_M4
    InterruptDisable(SDIO_IRQn);
#endif
#ifdef CORE_M0
    InterruptDisable(M0_SDIO_IRQn);
#endif
#ifdef CORE_M0SUB
    //None
#endif
    
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    TUInt32 value;
    //dprintf("Reboot SD card\n");
    // Set GPIOs low and hold power off to allow for proper power down then power up sequence.

    UEZGPIOUnlock(p->iSdMmcPins.iCMD);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT0);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT1);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT2);
    UEZGPIOUnlock(p->iSdMmcPins.iDAT3);
    UEZGPIOUnlock(p->iSdMmcPins.iCLK);
    UEZGPIOUnlock(p->iSdMmcPins.iPOW);
    UEZGPIOUnlock(p->iSdMmcPins.iCardDetect);
    //UEZGPIOUnlock(p->iSdMmcPins.iWriteProtect);
    
    value = ((p->iSdMmcPins.iCardDetect >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOSetMux(p->iSdMmcPins.iCardDetect, (p->iSdMmcPins.iCardDetect >> 8) >= 5 ? 4 : 0);
    UEZGPIOControl(p->iSdMmcPins.iCardDetect, GPIO_CONTROL_SET_CONFIG_BITS, value);
    UEZGPIOInput(p->iSdMmcPins.iCardDetect);
    UEZGPIOControl(p->iSdMmcPins.iCardDetect, GPIO_CONTROL_ENABLE_INPUT_BUFFER, 0);

    // Make sure that DAT0 does not draw power from MCU by setting low.
    UEZGPIOOutput(p->iSdMmcPins.iDAT0); 
    UEZGPIOSetMux(p->iSdMmcPins.iDAT0, (p->iSdMmcPins.iDAT0 >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iDAT0 >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iDAT0, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iDAT0);
    // Make sure that DAT1 does not draw power from MCU by setting low.
    UEZGPIOOutput(p->iSdMmcPins.iDAT1); 
    UEZGPIOSetMux(p->iSdMmcPins.iDAT1, (p->iSdMmcPins.iDAT1 >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iDAT1 >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iDAT1, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iDAT1);
    // Make sure that DAT2 does not draw power from MCU by setting low.
    UEZGPIOOutput(p->iSdMmcPins.iDAT2); 
    UEZGPIOSetMux(p->iSdMmcPins.iDAT2, (p->iSdMmcPins.iDAT2 >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iDAT2 >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iDAT2, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iDAT2);
    // Make sure that DAT3 does not draw power from MCU by setting low.
    UEZGPIOOutput(p->iSdMmcPins.iDAT3); 
    UEZGPIOSetMux(p->iSdMmcPins.iDAT3, (p->iSdMmcPins.iDAT3 >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iDAT3 >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iDAT3, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iDAT3);
    // Make sure that CMD does not draw power from MCU by setting low.
    UEZGPIOOutput(p->iSdMmcPins.iCMD); 
    UEZGPIOSetMux(p->iSdMmcPins.iCMD, (p->iSdMmcPins.iCMD >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iCMD >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iCMD, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iCMD);
    // Make sure that CLK does not draw power from MCU by setting low.
    // PC_0 does not have GPIO functionality. It has USB_ULPI_CLK, ENET_RX_CLK, LCD_CLK, SD_CLK, and ADC1_1
    // This Pin DOES contribute to current draw even though no GPIO as pull-up resistor is still enabled at reset.
    value = (1 << 3) | (1 << 4); // enable pull-down, disable pull-up, leave at reservered function
    UEZGPIOControl(p->iSdMmcPins.iCLK, GPIO_CONTROL_SET_CONFIG_BITS, value); // verified that we later correctly disable both pull in require.

    // First hold SD card power low for 200 ms to allow for full power down.
    UEZGPIOOutput(p->iSdMmcPins.iPOW); 
    UEZGPIOSetMux(p->iSdMmcPins.iPOW, (p->iSdMmcPins.iPOW >> 8) >= 5 ? 4 : 0);
    value = ((p->iSdMmcPins.iPOW >> 8) & 0x7) >= 5 ? 4 : 0;
    UEZGPIOControl(p->iSdMmcPins.iPOW, GPIO_CONTROL_SET_CONFIG_BITS, value);    
    UEZGPIOClear(p->iSdMmcPins.iPOW);
    UEZTaskDelay(200); // Power off delay, currently much longer than spec requires

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_IsCardInserted
 *---------------------------------------------------------------------------*
 * Description:
 *      Check Card detect line of socket
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      TBool              -- ETrue if card present
 *---------------------------------------------------------------------------*/
TBool LPC43xx_SD_MMC_IsCardInserted(void * aWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;    
    PARAM_NOT_USED(p);
    if(p->iSdMmcPins.iCardDetect != GPIO_NONE) {
      TBool read = UEZGPIORead(p->iSdMmcPins.iCardDetect);
      UEZBSPDelayUS(20);
      if (read == UEZGPIORead(p->iSdMmcPins.iCardDetect)){
        if(read == ETrue) {
          return ETrue; // card present both reads
        }
      }
      // If we read 2 different values or card disconnected then card was removed at least momentarily.
      return EFalse;
    } else {
      return ETrue;
    }
}

static int32_t ISendCommand(uint32_t aCommand, uint32_t aArgument)
{
    volatile int32_t timeout = 50;
    volatile int32_t delay; // very fast delays

    // Set command argument
    LPC_SDMMC->CMDARG = aArgument;
    LPC_SDMMC->CMD = MCI_CMD_START | aCommand;

