FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
    // Poll until accepted
    while (--timeout && (LPC_SDMMC->CMD & MCI_CMD_START)) {
        if (timeout & 1) {
            delay = 50;
        }
        else {
            delay = 18000;
        }

        while (--delay > 1) {}
    }

    return (timeout < 1) ? 1 : 0;
}

/* Read the response from the last command */
static void IGetResponse(uint32_t *resp)
{
    /* on this chip response is not a fifo so read all 4 regs */
    resp[0] = LPC_SDMMC->RESP0;
    resp[1] = LPC_SDMMC->RESP1;
    resp[2] = LPC_SDMMC->RESP2;
    resp[3] = LPC_SDMMC->RESP3;
}

/* Setup DMA descriptors */
void ISetupDMA(LPC43xx_SD_MMC_DMAArea *aDMAArea, TUInt32 addr, TUInt32 size)
{
    int32_t i = 0;
    TUInt32 ctrl, maxs;

    /* // Enable this code to check for unaligned Read/Write buffer pointers
       // so that you can remove them from the application.
    if (addr & 0x03) {
       UEZFailureMsg("LPC43xx_SD_MMC.c:ISetupDMA requires 32-bit aligned address!");
    }*/
    
    // Reset DMA
    LPC_SDMMC->CTRL |= MCI_CTRL_DMA_RESET | MCI_CTRL_FIFO_RESET;
    while (LPC_SDMMC->CTRL & MCI_CTRL_DMA_RESET) {
    }

    // Build a descriptor list using the chained DMA method
    while (size > 0) {
        // Limit size of the transfer to maximum buffer size
        maxs = size;
        if (maxs > MCI_DMADES1_MAXTR) {
            maxs = MCI_DMADES1_MAXTR; // cannot lower by 1
        }
        size -= maxs;

        /* Set buffer size */
        aDMAArea->mci_dma_dd[i].des1 = MCI_DMADES1_BS1(maxs);

        // Setup buffer address (chained)
        aDMAArea->mci_dma_dd[i].des2 = addr + (i * MCI_DMADES1_MAXTR);

        // Setup basic control
        ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;
        if (i == 0)
            ctrl |= MCI_DMADES0_FS; // First DMA buffer

        // No more data? Then this is the last descriptor
        if (!size) {
            ctrl |= MCI_DMADES0_LD;
        } else {
            ctrl |= MCI_DMADES0_DIC;
        }

        // Another descriptor is needed
        aDMAArea->mci_dma_dd[i].des3 = (uint32_t)&aDMAArea->mci_dma_dd[i + 1];
        aDMAArea->mci_dma_dd[i].des0 = ctrl;

        i++;
    }

    // Set DMA descriptor base address
    LPC_SDMMC->DBADDR = (uint32_t)&aDMAArea->mci_dma_dd[0];
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_ReadyTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare for a number of write block transactions.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_SD_MMCReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_ReadyTransmission(
    void *aWorkspace,
    const TUInt8 *aBuffer,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    TUInt32 *aNumWriting,
    T_SD_MMCTransmissionComplete aTransmissionCallback,
    void *aTransmissionCallbackWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    TUInt32 numBytes;

    // This implementation only supports 512 byte blocks!
    if (aBlockSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Determine how many blocks we are going to write (based on the
    // number requested to send and how much room we got).
    *aNumWriting = aNumBlocks;
    if (*aNumWriting >= NUM_MAX_BLOCKS)
        *aNumWriting = NUM_MAX_BLOCKS-1;
    //p->iNumWriting = *aNumWriting;

    numBytes = aBlockSize * aNumBlocks;
    LPC_SDMMC->BYTCNT = numBytes;

    // Set the callback routine (if any)
    p->iTransmissionCompleteCallback = aTransmissionCallback;
    p->iTransmissionCompleteCallbackWorkspace = aTransmissionCallbackWorkspace;

    ISetupDMA(&p->iDMAArea, (TUInt32) aBuffer, aNumBlocks * aBlockSize);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_SetRelativeCardAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the active RCA (Relative Card Address).
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aRCA            -- Relative Card Address (RCA)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_SetRelativeCardAddress(void *aWorkspace, TUInt32 aRCA)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    p->iRCA = aRCA;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_SetClockRate
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the clocking rate of the SD_MMC bus clock in Hz.  If power save
 *      mode is set, the clock is only run when communications is active,
 *      otherwise it is run continuously.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aHz             -- Clock rate in Hz.
 *      TBool aPowerSave        -- ETrue to save power by running the clock
 *                                  only when active, else EFalse to run
 *                                  clock continuously.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError ISetClockRate(
    void *aWorkspace,
    TUInt32 aHz)
{
    PARAM_NOT_USED(aWorkspace);
    //PARAM_NOT_USED(aPowerSave);

    TUInt32 clk_rate = G_SourceClkFrequency;

    // Power save means the clock ONLY runs when needed, otherwise the SD CLK
    // runs continuously.
    if (aHz == 0) {

    } else {
        /* compute SD/MCI clock dividers */
        uint32_t div;
        uint32_t div_rem;

