FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
        div_rem = ((clk_rate % aHz)); // This doesn't handle less than 400KHz since that is MAX divider!
        div = ((clk_rate / aHz)) >> 1;
        if(div_rem != 0) {
          div = div +1;
        }
        if ((div == LPC_SDMMC->CLKDIV) && (LPC_SDMMC->CLKENA & SDMMC_CLKENA_CCLK_ENABLE_Msk)) {
            return UEZ_ERROR_NONE; /* Closest speed is already set */

        }
        // disable clock - clock must be disabled for minimum time before changing it.
        LPC_SDMMC->CLKENA = 0;

        /* User divider 0 */
        LPC_SDMMC->CLKSRC = MCI_CLKSRC_CLKDIV0;

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

        /* set divider 0 to desired value */
        LPC_SDMMC->CLKDIV = MCI_CLOCK_DIVIDER(0, div);

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

        /* enable clock */
        if(aHz <=400000UL) {
          LPC_SDMMC->CLKENA = MCI_CLKEN_ENABLE; // run clock constantly
        } else {
          LPC_SDMMC->CLKENA = MCI_CLKEN_ENABLE | MCI_CLKEN_LOW_PWR; // only run clock when not idling.
        }

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC43xx_SD_MMC_SetClockRate(
    void *aWorkspace,
    TUInt32 aHz)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;

    // Remember speed for later
    p->iSpeed = aHz;

    if(aHz <=400000UL) { // force clock to come on even if we haven't sent a command yet.
      ISetClockRate(aWorkspace, p->iSpeed);
    } else { // otherwise set clock back into low power mode (will take affect before first real command is sent).      
    }

    return UEZ_ERROR_NONE;
}

static void IEventSetup(T_LPC43xx_SD_MMC_Workspace *p, void *bits)
{
    uint32_t bit_mask = *((uint32_t *)bits);

    /* Wait for IRQ - for an RTOS, you would pend on an event here with a IRQ based wakeup. */

#ifdef CORE_M4
    NVIC_ClearPendingIRQ(SDIO_IRQn);
    p->sdio_wait_exit = 1;
    LPC_SDMMC->INTMASK = bit_mask;
    InterruptEnable(SDIO_IRQn);
#endif
#ifdef CORE_M0
    NVIC_ClearPendingIRQ(M0_SDIO_IRQn);
    p->sdio_wait_exit = 1;
    LPC_SDMMC->INTMASK = bit_mask;
    InterruptEnable(M0_SDIO_IRQn);
#endif
#ifdef CORE_M0SUB
    //NVIC_ClearPendingIRQ(SDIO_IRQn);
    p->sdio_wait_exit = 1;
    LPC_SDMMC->INTMASK = bit_mask;
    //InterruptEnable(SDIO_IRQn);
#endif
}

static uint32_t IIRQWait(T_LPC43xx_SD_MMC_Workspace *p)
{
    uint32_t status;
    TUInt32 start;

    start = UEZTickCounterGet();

    /* Wait for event, with timeout*/
    while (p->sdio_wait_exit != 2) { // we only call from one place and interrupt can't reset this number.
        // So if we already hit interrupt before reaching this function, we will just continue to status return below without going into loop. (this is what we want)
        // Spinning.... Very fast wait time in microsecond range
        if (UEZTickCounterGetDelta(start) >= 500) { // hit > 25 on samsung cards in video player. Our timing isn't very accurate and from SD spec 
            break; // for CMD ACK response (say that we are "going to" do multiple block read) it is 64 cycles or 1.28us at 51MHz or 163.2us at 400Khz.
            // If we had a separate accurate timer that doesn't get stopped by RTOS we could check 1ms timeout for initial command response.
            // Per SD spec 3.01 table 4-51 SDHC/SDXC is max read access time of 100ms (for some large multiple block read).
            // So we will always set above that here to account for our innacuracies. If we timeout on large delay we need to mark SD card non-inserted and try to re-init, as it should't be this long.
        }
        UEZTaskDelay(0); // force reschedule to allow quick background tasks to run, but don't delay.
        // Any non-zero delay here would slowdown something like video player noticeably.
    }

    /* Get status and clear interrupts */
    status = LPC_SDMMC->RINTSTS;
    LPC_SDMMC->RINTSTS = status;
    LPC_SDMMC->INTMASK = 0;

    return status;
}

#ifdef DEBUG_CMD
typedef struct {
      uint32_t cmd;
      uint32_t arg;
      uint32_t wait_status;
      uint32_t response[4];
} T_mmcCmd;
T_mmcCmd G_cmds[100];
int32_t G_numCmds = 0;

static T_mmcCmd *SDMMCLog(uint32_t cmd, uint32_t arg, uint32_t wait_status)
{
  if (G_numCmds < 100) {
    T_mmcCmd *p = G_cmds + G_numCmds++;
    p->cmd = cmd;
    p->arg = arg;
    p->wait_status = wait_status;
    p->response[0] = 0;
    p->response[1] = 0;
    p->response[2] = 0;
    p->response[3] = 0;
    return p;
  }
  return 0;
}
#endif

TUInt32 LPC43xx_SD_MMC_ExecuteCommand(
            void *aWorkspace,
            TUInt32 aCommand,
            TUInt32 aArgument,
            TUInt32 aWaitStatus,
            TUInt32 *aResponse)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    int32_t step = (aCommand & CMD_BIT_APP) ? 2 : 1;
    int32_t status = 0;
    uint32_t cmd_reg = 0;

    if (!aWaitStatus) {
        aWaitStatus = (aCommand & CMD_MASK_RESP) ? MCI_INT_CMD_DONE : MCI_INT_DATA_OVER;
    }

    // Zero out the response
    aResponse[0] = 0;
    aResponse[1] = 0;
    aResponse[2] = 0;
    aResponse[3] = 0;
#ifdef DEBUG_CMD
    T_mmcCmd *p_cmd = SDMMCLog(aCommand, aArgument, aWaitStatus);
#endif

    /* Clear the interrupts & FIFOs*/
    if (aCommand & CMD_BIT_DATA)
        ISetClearIntFifo();

    /* also check error conditions */
    aWaitStatus |= MCI_INT_EBE | MCI_INT_SBE | MCI_INT_HLE | MCI_INT_RTO | MCI_INT_RCRC | MCI_INT_RESP_ERR;
    if (aWaitStatus & MCI_INT_DATA_OVER)
        aWaitStatus |= MCI_INT_FRUN | MCI_INT_HTO | MCI_INT_DTO | MCI_INT_DCRC;

    while (step) {
        ISetClockRate(aWorkspace, p->iSpeed);

        /* Clear the interrupts */
        LPC_SDMMC->RINTSTS = 0xFFFFFFFF;

        IEventSetup(p, (void *)&aWaitStatus);

        switch (step) {
            case 1: /* Execute command */
                cmd_reg = ((aCommand & CMD_MASK_CMD) >> CMD_SHIFT_CMD)
                        | ((aCommand & CMD_BIT_INIT) ? MCI_CMD_INIT : 0)
                        | ((aCommand & CMD_BIT_DATA) ? (MCI_CMD_DAT_EXP | MCI_CMD_PRV_DAT_WAIT) : 0)
                        | (((aCommand & CMD_MASK_RESP) == CMD_RESP_R2) ? MCI_CMD_RESP_LONG : 0)
                        | ((aCommand & CMD_MASK_RESP) ? MCI_CMD_RESP_EXP : 0)
                        | ((aCommand & CMD_BIT_WRITE) ? MCI_CMD_DAT_WR : 0)
                        | ((aCommand & CMD_BIT_STREAM) ? MCI_CMD_STRM_MODE : 0)
                        | ((aCommand & CMD_BIT_BUSY) ? MCI_CMD_STOP : 0)
                        | ((aCommand & CMD_BIT_AUTO_STOP) ? MCI_CMD_SEND_STOP : 0)
                        | MCI_CMD_START;

                /* wait for previos data finsh for select/deselect commands */
                if (((aCommand & CMD_MASK_CMD) >> CMD_SHIFT_CMD) == MMC_SELECT_CARD) {
                    cmd_reg |= MCI_CMD_PRV_DAT_WAIT;
                }

                /* wait for command to be accepted by CIU */
                if (ISendCommand(cmd_reg, aArgument) == 0)
                    --step;
                break;

            case 0:
                return 0;

            case 2: /* APP prefix */
                cmd_reg = MMC_APP_CMD | MCI_CMD_RESP_EXP | ((aCommand & CMD_BIT_INIT) ? MCI_CMD_INIT : 0) |
                MCI_CMD_START;

                if (ISendCommand(cmd_reg, (p->iRCA << 16)) == 0)
                    --step;
                break;
        }

        // wait for command response (does not use semaphores?)
        // Only used for fast interrupts
        status = IIRQWait(p); // TODO wait earlier for interrupt as we might get it earlier

