FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SD_MMC.c
        /* We return an error if there is a timeout, even if we've fetched  a response */
        if (status & SD_INT_ERROR) {
            return status;
        }

        if (status & MCI_INT_CMD_DONE) {
            switch (aCommand & CMD_MASK_RESP) {
                case 0:
                    break;

                case CMD_RESP_R1:
                case CMD_RESP_R3:
                case CMD_RESP_R2:
                    IGetResponse(aResponse);
                    break;
            }
        }
#ifdef DEBUG_CMD
        p_cmd->response[0] = aResponse[0];
        p_cmd->response[1] = aResponse[1];
        p_cmd->response[2] = aResponse[2];
        p_cmd->response[3] = aResponse[3];
#endif
    }

    return 0;
}

void LPC43xx_SD_MMC_SetCardType(void *aWorkspace, TUInt32 aType)
{
    PARAM_NOT_USED(aWorkspace);
    LPC_SDMMC->CTYPE = aType;
}
void LPC43xx_SD_MMC_SetBlockSize(void *aWorkspace, TUInt32 bytes)
{
    PARAM_NOT_USED(aWorkspace);
    LPC_SDMMC->BLKSIZ = bytes;
}

void LPC43xx_SD_MMC_PrepreExtCSDTransfer(void *aWorkspace, TUInt8 *aAddress, TUInt32 aTransferSize)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;

    // Prepare the size
    LPC_SDMMC->BLKSIZ = aTransferSize;
    LPC_SDMMC->BYTCNT = aTransferSize;

    // Setup the DMA
    ISetupDMA(&p->iDMAArea, (TUInt32)aAddress, aTransferSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_SD_MMC_ReadyReception
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare the SD_MMC Controller for receiving blocks of data of the
 *      given size (usually 512 bytes).  When each block is received, call
 *      the given callback routine.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aNumBlocks      -- Number of blocks to receive
 *      TUInt32 aBlockSize      -- Block size.  Should be multiple of 4 and
 *                                  a power of 2.  Currently only 512 supported.
 *      T_SD_MMCReceptionComplete aReceptionCallback - Callback routine when
 *                                  received block.
 *      void *aReceptionCallbackWorkspace -- Workspace for callback.
 *      TUInt32 aNumBlocksReady -- Number of blocks readied equal or or less
 *                                  than aNumBlocks.  Can be zero.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_SD_MMC_ReadyReception(
    void *aWorkspace,
    TUInt8 *aBuffer,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    T_SD_MMCReceptionComplete aReceptionCallback,
    void *aCallbackWorkspace,
    TUInt32 *aNumBlocksReady)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;
    TUInt32 byteCount;

    if (aNumBlocks > NUM_MAX_BLOCKS)
        aNumBlocks = NUM_MAX_BLOCKS;
    *aNumBlocksReady = aNumBlocks;

    p->iReceptionCompleteCallback = aReceptionCallback;
    p->iReceptionCompleteCallbackWorkspace = aCallbackWorkspace;

    byteCount = aNumBlocks * aBlockSize;

    // Set the number of bytes to read
    LPC_SDMMC->BYTCNT = byteCount;

    ISetupDMA(&p->iDMAArea, (TUInt32) aBuffer, aNumBlocks * aBlockSize);

    return UEZ_ERROR_NONE;
}

void LPC43xx_SD_MMC_SetupErrorCallback (void *aWorkspace, T_SD_MMCError aErrorCallback,
     void *aErrorCallbackWorkspace)
{
    T_LPC43xx_SD_MMC_Workspace *p = (T_LPC43xx_SD_MMC_Workspace *)aWorkspace;  
    p->iErrorCallback = aErrorCallback;
    p->iErrorCallbackWorkspace = aErrorCallbackWorkspace;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SD_MMC LPC43xx_SD_MMC_Interface = { {
    "LPC43xx:SD_MMC",
    0x0204,
    LPC43xx_SD_MMC_InitializeWorkspace,
    sizeof(T_LPC43xx_SD_MMC_Workspace), },

    // v2.04
    LPC43xx_SD_MMC_PowerOn,
    LPC43xx_SD_MMC_PowerOff,
    LPC43xx_SD_MMC_Reset,
    LPC43xx_SD_MMC_ExecuteCommand,
    LPC43xx_SD_MMC_ReadyReception,
    LPC43xx_SD_MMC_SetRelativeCardAddress,
    LPC43xx_SD_MMC_SetClockRate,
    LPC43xx_SD_MMC_ReadyTransmission,
    LPC43xx_SD_MMC_SetCardType,
    LPC43xx_SD_MMC_SetBlockSize,
    LPC43xx_SD_MMC_PrepreExtCSDTransfer,
    LPC43xx_SD_MMC_SetupErrorCallback,
    // uEZ 2.14
    LPC43xx_SD_MMC_IsCardInserted
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC43xx_SD_MMC_Require(const T_LPC43xx_SD_MMC_Pins *aPins)
{
    T_halWorkspace *p_SD_MMC;
    T_LPC43xx_SD_MMC_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();

    // Register SD_MMC Controller
    HALInterfaceRegister("SD_MMC",
            (T_halInterface *)&LPC43xx_SD_MMC_Interface, 0, &p_SD_MMC);
    p = (T_LPC43xx_SD_MMC_Workspace *)p_SD_MMC;

    // set the pins from the platform assignment.
    memcpy((void *)&p->iSdMmcPins, (void *)aPins, sizeof(p->iSdMmcPins)); 
    // Currently card detect and write protect aren't implemented.
    // Currently power control is just GPIO and could be probably.
    // Currently we only support the non-GPIO CLK pin.
    LPC43xx_SD_MMC_PowerOff(p); // set pins to GPIO mode and hold power off

    // Turn on the SD_MMC Controller
    G_SourceClkFrequency = UEZPlatform_GetPCLKFrequency(); //clock based on PCLK
    LPC_CGU->BASE_SDIO_CLK = (9<<24) | (1<<11); //Use PLL1 clock
    LPC_CCU1->CLK_M4_SDIO_CFG = 3;

    /* 17.4.10 SD/MMC delay register
     * This register provides a programmable delay for the SD/MMC sample and drive inputs
     * and outputs. See the LPC43xx/LPC43Sxx data sheets for recommended settings.
     * Typical setting for SD cards are SAMPLE_DELAY = 0x8 and DRV_DELAY = 0xF.
     * Remark: The values DRV_DELAY = 0 and DRV_DELAY = 1 are not allowed*/
    
    // The numbers from both the datasheet and user's manual for SDDElay are too large and lead to immediate failure of SD card at all tested frequencies.
    // Values of 0 not only aren't allowed but cause issues, so we need small numbers for each setting.
    // Note that other newer LPC MCU families with this same register appear to have a different preferred number even for the same frequencies. (different range)

    // Drive delay minimum of 2 is required.    
    LPC_SCU->SDDELAY = (2 << SCU_SDDELAY_SAMPLE_DELAY_Pos) | (3 << SCU_SDDELAY_DRV_DELAY_Pos); // This passes test with 34MHz read, 48MHz read/write, 51MHz read/write, and 25.5MHz read/write.


    // Setup interrupt for the SD_MMC, but don't enable it yet until we init everything.
#ifdef CORE_M4
    InterruptRegister(SDIO_IRQn, LPC43xx_SD_MMC_Interrupt,
        INTERRUPT_PRIORITY_HIGH, "SD_MMC");
#endif
#ifdef CORE_M0
    InterruptRegister(M0_SDIO_IRQn, LPC43xx_SD_MMC_Interrupt,
        INTERRUPT_PRIORITY_HIGH, "SD_MMC");
#endif
#ifdef CORE_M0SUB
    //None
#endif
    // Registers are reset and power is enabled on each init of SD card.
}

/*-------------------------------------------------------------------------*
 * End of File:  LPC43xx_SD_MMC.c
 *-------------------------------------------------------------------------*/
